Repository: Ahmadbhatti978/Uprides-customer-app
Catalog: lib/l10n/app_*.arb
Languages: pt

# regularVehicleInspectionsTitle
source: 1. Regular Vehicle Inspections
pt: 1. Inspeções regulares aos veículos

# regularVehicleInspectionsDesc
source: All vehicles registered with our platform undergo strict and regular inspections. This ensures that they meet safety and quality standards, reducing the risk of mechanical issues during rides.
pt: Todos os veículos registados na nossa plataforma passam por inspeções rigorosas e regulares. Isto garante que cumprem os padrões de segurança e qualidade, reduzindo o risco de problemas mecânicos durante as viagens.

# driverVerificationTrainingTitle
source: 2. Driver Verification and Training
pt: 2. Verificação e formação dos motoristas

# driverVerificationTrainingDesc
source: Every driver is thoroughly verified before joining our platform. Additionally, we offer safety training and guidance, equipping drivers with the knowledge they need to handle various situations responsibly.
pt: Cada motorista é devidamente verificado antes de entrar na plataforma. Além disso, oferecemos formação e orientação de segurança, dotando os motoristas de conhecimentos para lidar com várias situações de forma responsável.

# realTimeRideMonitoringTitle
source: 3. Real-Time Ride Monitoring
pt: 3. Monitorização da viagem em tempo real

# realTimeRideMonitoringDesc
source: Our app includes real-time ride tracking, allowing both passengers and their loved ones to monitor the trip. In case of an emergency, passengers can quickly share their location.
pt: A app inclui acompanhamento em tempo real, permitindo que passageiros e familiares acompanhem a viagem. Em caso de emergência, os passageiros podem partilhar rapidamente a sua localização.

# inAppEmergencyAssistanceTitle
source: 4. In-App Emergency Assistance
pt: 4. Assistência de emergência na app

# inAppEmergencyAssistanceDesc
source: We provide an in-app emergency button that instantly connects passengers to local authorities or our dedicated support team. Quick assistance is just a tap away.
pt: Disponibilizamos um botão de emergência na app que liga instantaneamente para as autoridades locais ou para a nossa equipa de suporte dedicada. A ajuda está a um toque de distância.

# safetyFeedbackMechanismTitle
source: 5. Safety Feedback Mechanism
pt: 5. Mecanismo de feedback de segurança

# safetyFeedbackMechanismDesc
source: After each ride, passengers can rate and provide feedback on the vehicle's condition and driver behaviour. This helps us maintain high safety standards by addressing any issues promptly. Your safety is our top priority, and we continually strive to improve. By focusing on vehicle safety and driver accountability, we aim to make every ride a secure and pleasant experience. Ready to experience safer rides? Book ride today and travel with peace of mind!
pt: Após cada viagem, os passageiros podem avaliar e dar feedback sobre o estado do veículo e o comportamento do motorista. Isto ajuda-nos a manter padrões elevados de segurança, resolvendo rapidamente quaisquer problemas. A sua segurança é a nossa principal prioridade e melhoramos continuamente. Ao focar a segurança do veículo e a responsabilidade do motorista, queremos tornar cada viagem segura e agradável. Pronto para viagens mais seguras? Peça já a sua viagem e viaje com tranquilidade!

# ensuringPassengerSafetyTitle
source: Ensuring Passenger Safety – Our Top Priority
pt: Garantir a segurança do passageiro – a nossa maior prioridade

# ensuringPassengerSafetyDesc
source: When you book a ride, your primary expectation is not just a convenient ride but also a safe and secure journey. Our ride application is designed with advanced safety features to give you peace of mind, ensuring every trip is as safe as it is smooth
pt: Quando pede uma viagem, espera não só conveniência, mas também uma experiência segura. A nossa aplicação inclui funcionalidades avançadas para lhe dar tranquilidade, garantindo que cada viagem é tão segura quanto suave.

source: Key Safety Features
pt: Principais funcionalidades de segurança

source: Driver Verification
pt: Verificação do motorista

# driverVerificationDesc
source: All our drivers undergo a strict background check and verification process. This ensures that only trusted and responsible individuals are behind the wheel.
pt: Todos os nossos motoristas passam por verificações e antecedentes rigorosos. Assim, apenas pessoas de confiança ficam ao volante.

source: Real-Time Tracking
pt: Acompanhamento em tempo real

# realTimeTrackingDesc
source: Track your ride in real time, share your live location with friends or family, and stay connected throughout your journey.
pt: Acompanhe a sua viagem em tempo real, partilhe a sua localização com amigos ou família e mantenha-se ligado durante todo o percurso.

source: Emergency Assistance
pt: Assistência de emergência

# emergencyAssistanceDesc
source: With the in-app Emergency Button, you can quickly alert your emergency contacts and our support team in case of any distress.
pt: Com o Botão de Emergência na app, pode alertar rapidamente os seus contactos de emergência e a nossa equipa de suporte em caso de necessidade.

source: Trip Reviews and Ratings
pt: Avaliações e classificações

# tripReviewsAndRatingsDesc
source: Your feedback helps us maintain high standards of safety. Passengers can rate drivers and report any concerns for immediate action.
pt: O seu feedback ajuda-nos a manter altos padrões de segurança. Os passageiros podem avaliar motoristas e reportar preocupações para ação imediata.

# tipsForSafeRide
source: Tips for a Safe Ride
pt: Dicas para uma viagem segura

source: Verify the Driver:
pt: Verifique o motorista:

# verifyTheDriverDesc
source: Before starting your trip, check the driver’s photo, vehicle number, and name displayed in the app.
pt: Antes de começar, confirme a foto do motorista, a matrícula e o nome apresentados na app.

source: Buckle Up
pt: Coloque o cinto

# buckleUpDesc
source: : Always wear your seatbelt for added safety during the ride.
pt: : Use sempre o cinto de segurança para maior proteção durante a viagem.

source: Share Your Ride:
pt: Partilhe a sua viagem:

# shareYourRideDesc
source: Use the "Share Trip" feature to keep your loved ones informed about your journey in real time.
pt: Use a funcionalidade "Partilhar viagem" para manter os seus entes queridos informados em tempo real.

source: Your Safety, Our Commitment
pt: A sua segurança, o nosso compromisso

# yourSafetyOurCommitmentDesc
source: We believe a great ride is a safe ride. By combining technology, trained drivers, and a responsive support system, we aim to create a safer travel experience for everyone. Your trust drives us forward, and we’re dedicated to protecting what matters most—you. Download our app, ride with confidence, and experience safety like never before!
pt: Acreditamos que uma ótima viagem é uma viagem segura. Combinando tecnologia, motoristas formados e um suporte atento, criamos uma experiência mais segura para todos. A sua confiança move-nos, e estamos dedicados a proteger o que mais importa — você. Transfira a app, viaje com confiança e sinta a segurança como nunca!

# importanceOfEmergencyContactTitle
source: The Importance of Adding an Emergency Contact in your Uprides app
pt: A importância de adicionar um contacto de emergência na sua app Uprides

# importanceOfEmergencyContactDesc
source: Safety is a priority when using any transportation service, especially in today’s fast-paced world. Our ride application introduces an essential feature designed with your well-being in mind: the Emergency Contact option.
pt: A segurança é uma prioridade ao usar qualquer serviço de transporte, especialmente no mundo acelerado de hoje. A nossa app inclui uma funcionalidade essencial pensada no seu bem-estar: o Contacto de Emergência.

# whyAddEmergencyContactTitle
source: Why Should You Add an Emergency Contact?
pt: Porque deve adicionar um contacto de emergência?

# whyAddEmergencyContactDesc
source: Emergencies can happen at any time, and having a trusted person available to help is invaluable. By adding an emergency contact, you ensure that someone close to you is just a click away in case of unforeseen situations. Whether it’s a mechanical issue, sudden health concern, or feeling unsafe, this feature gives you an added layer of security.
pt: Emergências podem acontecer a qualquer momento, e ter alguém de confiança disponível para ajudar é inestimável. Ao adicionar um contacto de emergência, garante que alguém próximo está a um clique em situações imprevistas. Seja um problema mecânico, uma questão de saúde súbita ou sentir-se inseguro, esta função dá-lhe uma camada extra de proteção.

# howItWorksTitle
source: How It Works
pt: Como funciona

# howItWorksDesc
source: Quick Setup: Simply input the name and phone number of a trusted friend or family member in the app settings. Instant Alerts: In case of an emergency, tap the emergency button. Your contact will immediately receive an alert with your real-time location and trip details. Peace of Mind: Both you and your loved ones can relax, knowing help is always within reach.
pt: Configuração rápida: introduza o nome e número de telefone de um amigo ou familiar de confiança nas definições da app. Alertas imediatos: em caso de emergência, toque no botão de emergência. O seu contacto recebe de imediato um alerta com a sua localização em tempo real e detalhes da viagem. Tranquilidade: você e os seus entes queridos ficam mais descansados, sabendo que a ajuda está sempre por perto.

# staySafeStayConnectedTitle
source: Stay Safe, Stay Connected
pt: Mantenha-se seguro, mantenha-se ligado

# staySafeStayConnectedDesc
source: We are committed to creating a safer experience for all our users. Adding an emergency contact is a simple but powerful way to protect yourself and keep those who care about you informed. It’s a small step that makes a big difference. Make your rides safer today—add your emergency contact now!
pt: Estamos comprometidos em criar uma experiência mais segura para todos os utilizadores. Adicionar um contacto de emergência é uma forma simples mas poderosa de se proteger e manter informadas as pessoas que se preocupam consigo. Um pequeno passo que faz uma grande diferença. Torne as suas viagens mais seguras — adicione já o seu contacto de emergência!

# cancellationPolicyTitle
source: Cancellation Policy
pt: Política de cancelamento

# freeCancellationWindow
source: 1. Free Cancellation Window
pt: 1. Janela de cancelamento gratuito

source: Standard Rides:
pt: Viagens padrão:

# standardRidesDesc
source: Riders may cancel without charge within 2 minutes of Driver acceptance. The countdown timer is displayed in-app immediately after a Driver confirms.
pt: Os passageiros podem cancelar sem custos até 2 minutos após a aceitação do motorista. O temporizador é apresentado na app assim que o motorista confirma.

source: Pre-Booked Rides:
pt: Viagens agendadas:

# preBookedRidesDesc
source: Riders scheduling in advance have a 15-minute free cancellation window after assignment (or as shown in-app for that booking).
pt: Para viagens marcadas com antecedência, existe uma janela de 15 minutos de cancelamento gratuito após a atribuição (ou conforme apresentado na app).

# whenFeesApply
source: 2. When Cancellation Fees Apply
pt: 2. Quando se aplicam taxas de cancelamento

# whenFeesApplyDesc
source: A cancellation fee will be charged if:
pt: Será cobrada uma taxa de cancelamento se:

# riderCancelsAfterGrace
source: 1. Rider Cancels After Grace Period:
pt: 1. Cancelamento após o período gratuito:

# riderCancelsAfterGraceDesc
source: You cancel after the free window has closed (timer shown in-app).
pt: Cancelar depois de a janela gratuita terminar (temporizador mostrado na app).

# riderRejectsRide
source: 2. Rider Rejects the Ride:
pt: 2. Recusar a viagem:

# riderRejectsRideDesc
source: You explicitly reject or refuse the ride after the Driver has accepted your request.
pt: Recusar explicitamente a viagem depois de o motorista ter aceite o seu pedido.

# noShow
source: 3. No-Show:
pt: 3. Não comparência:

# noShowDesc
source: You fail to board within 5 minutes of the Driver notifying arrival at pick-up.
pt: Não embarcar dentro de 5 minutos após o motorista notificar a chegada no local de recolha.

source: Why a Fee?
pt: Porque é cobrada uma taxa?

# whyAFeeDesc
source: Compensates the Driver for time, fuel and opportunity costs incurred in traveling to your pick-up.
pt: Compensa o motorista pelo tempo, combustível e oportunidade despendidos para chegar ao ponto de recolha.

# howYouWillSeeFee
source: 3. How You’ll See the Fee
pt: 3. Como verá a taxa

source: In-App Display:
pt: Exibição na app:

# inAppDisplayDesc
source: When a cancellation fee applies, the exact amount will be displayed for your confirmation before the cancellation is final.
pt: Quando se aplica uma taxa de cancelamento, o valor exato é mostrado para sua confirmação antes do cancelamento final.

# feeOnReceipt
source: Receipt:
pt: Recibo:

# feeOnReceiptDesc
source: Your trip receipt (in-app or by email) will show the fee, its type (cancellation or no-show) and how it was calculated.
pt: O seu recibo (na app ou por email) mostrará a taxa, o tipo (cancelamento ou não comparência) e como foi calculada.

# waiversAndExceptions
source: 4. Waivers & Exceptions
pt: 4. Isenções e exceções

# waiversAndExceptionsDesc
source: You will not be charged a cancellation fee if:
pt: Não será cobrada taxa de cancelamento se:

source: Driver Delay:
pt: Atraso do motorista:

# driverDelayDesc
source: The Driver’s ETA exceeds the in-app estimate by more than 5 minutes, or GPS shows them moving away from your pick-up point.
pt: A ETA do motorista exceder a estimativa da app em mais de 5 minutos, ou o GPS mostrar que se afasta do ponto de recolha.

source: Driver Cancellation:
pt: Cancelamento pelo motorista:

# driverCancellationDesc
source: The Driver cancels before you do.
pt: O motorista cancelar antes de si.

source: Technical Error:
pt: Erro técnico:

# technicalErrorDispute
source: App or payment-authorization failures prevent completion. To dispute an erroneous charge, go to Help > Trip Issues > I was charged a cancellation fee in-app, or email {email} within 14 days of the trip.
pt: Falhas da app ou de autorização de pagamento impedirem a conclusão. Para contestar uma cobrança indevida, vá a Ajuda > Problemas na viagem > Fui cobrado por taxa de cancelamento na app, ou envie email para {email} em até 14 dias após a viagem.

# driverCancellationsAndNoShows
source: 5. Driver Cancellations & No-Shows
pt: 5. Cancelamentos e não comparências do motorista

source: Driver-Initiated Cancellation:
pt: Cancelamento iniciado pelo motorista:

# driverInitiatedCancellationDesc
source: No fee is charged to you if the Driver cancels before arrival.
pt: Não é cobrada taxa se o motorista cancelar antes da chegada.

source: Driver No-Show:
pt: Não comparência do motorista:

# driverNoShowDesc
source: No fee applies if the Driver does not arrive within 5 minutes of ETA and then cancels. While UPrides isn’t liable for unilateral Driver cancellations, we’ll help you rebook promptly.
pt: Não há taxa se o motorista não chegar dentro de 5 minutos da ETA e cancelar. Embora a Uprides não seja responsável por cancelamentos unilaterais do motorista, ajudaremos a remarcar rapidamente.

# waitingTimeCharges
source: 6. Waiting Time Charges
pt: 6. Taxas de tempo de espera

# waitingTimeChargesDesc
source: If you require the Driver to wait after arrival notification (for example, you’re delayed boarding), a waiting-time charge may apply at the rate shown in-app. You’ll see the applicable per-minute rate before confirming any wait.
pt: Se necessitar que o motorista aguarde após a notificação de chegada, poderá aplicar-se uma taxa de espera ao valor por minuto mostrado na app. Verá a tarifa aplicável antes de confirmar.

# preBookedAndGroupRides
source: 7. Pre-Booked & Group Rides
pt: 7. Viagens agendadas e em grupo

source: Advance Cancellation:
pt: Cancelamento antecipado:

# advanceCancellationDesc
source: For scheduled rides, cancel at least 1 hour before pick-up (or as shown in-app) to avoid fees.
pt: Para viagens agendadas, cancele pelo menos 1 hora antes da recolha (ou conforme indicado na app) para evitar taxas.

source: Group Bookings:
pt: Reservas de grupo:

# groupBookingsDesc
source: Any applicable cancellation fee is charged per booking (not per passenger).
pt: Qualquer taxa aplicável é cobrada por reserva (não por passageiro).

# contactSupport
source: For any questions or further assistance, contact our Support team via the in-app Help Center or at {email}.
pt: Para dúvidas ou assistência, contacte o Suporte pela Central de Ajuda na app ou pelo email {email}.

# supportEmail
source: support@uprides.eu
pt: [support@uprides.eu](mailto:support@uprides.eu)

# refer_friends_credit_title
source: Refer friends. Every first ride they take adds credit to your wallet
pt: Recomende amigos. Cada primeira viagem deles adiciona crédito à sua carteira

# send_link_get5_title
source: Send your link. Get €5 in your wallet when a friend signs up
pt: Envie a sua ligação. Ganhe €5 na carteira quando um amigo se registar

# refer_friends_earn100_title
source: Refer friends and earn up to €100 in ride credit or discounts as they ride
pt: Recomende amigos e ganhe até €100 em créditos de viagem ou descontos à medida que eles viajam

# explore_cool_spots_title
source: Check out cool spots just around the corner. You explore, we’ll drive.
pt: Descubra sítios fixes ao virar da esquina. Você explora, nós conduzimos.

# generous_friend_title
source: Got a generous friend? Book your ride and tap to let them pay!
pt: Tem um amigo generoso? Reserve a viagem e toque para o deixar pagar!

# go_xl_more_seats_title
source: Rolling deep? Go XL for more seats, extra legroom, and better vibes.
pt: Vai com a malta? Escolha XL para mais lugares, espaço e conforto.

# request_payment_no_cash_title
source: Book your ride, request payment — no cash, no stress.
pt: Reserve a viagem, peça pagamento — sem dinheiro, sem stress.

source: Rides
pt: Viagens

# emergency
source: Emrgency
pt: Emergência

source: Something went wrong
pt: Ocorreu um erro

source: Total Amount
pt: Valor total

source: Edit ride
pt: Editar viagem

source: Privacy Policy
pt: Política de privacidade

source: Terms & Conditions
pt: Termos e condições

source: Ride type
pt: Tipo de viagem

# scheduled_rides
source: Scheduled ride
pt: Viagem agendada

# report_des
source: Let us know your concern. Select the options listed below and proceed.
pt: Diga-nos a sua preocupação. Selecione as opções abaixo e prossiga.

source: Ride in Progress
pt: Viagem em curso

# you_already_have_an_active_ride
source: You already have an active ride. Please complete your current trip before requesting a new one.
pt: Já tem uma viagem ativa. Termine a atual antes de pedir outra.

source: View Current Ride
pt: Ver viagem atual

source: Locations are in different countries
pt: As localizações estão em países diferentes

source: No
pt: Não

source: Yes
pt: Sim

source: Get Code
pt: Obter código

source: Yes, delete
pt: Sim, eliminar

# pickup_stop_same
source: Your pickup and stop are the same.
pt: O seu ponto de recolha e a paragem são iguais.

# pickup_stop_same_des
source: Please select a different stop location.
pt: Selecione uma localização de paragem diferente.

# stop_drop_off_same
source: Your stop and drop‑off are the same.
pt: A sua paragem e o destino são iguais.

# you_already_have_an_active_ride_to_log_out
source: You already have an active ride. Please complete your current trip before logging out.
pt: Já tem uma viagem ativa. Termine a viagem antes de terminar a sessão.

source: Profile updated successfully
pt: Perfil atualizado com sucesso

source: Preferred Language
pt: Idioma preferido

source: Are you sure you want to delete your account?
pt: Tem a certeza de que pretende eliminar a sua conta?

# delete_account_description
source: We’re sorry to see you go. Deleting your account will permanently remove your personal data, ride history, and saved preferences.
pt: Lamentamos vê-lo partir. Eliminar a sua conta remove permanentemente os seus dados pessoais, histórico de viagens e preferências guardadas.

# select_a_reason_to_delete_account
source: Select a reason for leaving:
pt: Selecione um motivo para sair:

# delete_reason_no_longer_using_uprides
source: I'm no longer using Uprides
pt: Já não utilizo a Uprides

# delete_reason_service_too_expensive
source: The service is too expensive
pt: O serviço é demasiado caro

# delete_reason_want_to_change_phone_number
source: I want to change my phone number
pt: Quero alterar o meu número de telefone

# delete_reason_dont_understand_how_to_use_app
source: I don't understand how to use the app
pt: Não percebo como usar a app

# delete_reason_not_available_in_city
source: Uprides is not available in my city
pt: A Uprides não está disponível na minha cidade

source: Enter your phone number
pt: Introduza o seu número de telefone

source: Become a Driver
pt: Torne-se motorista

# user_payment_id
source: USER/PAYMENT ID: {id}
pt: ID DE UTILIZADOR/PAGAMENTO: {id}

# become_a_driver_description
source: Join our community of drivers and earn money on your own schedule.
pt: Junte-se à nossa comunidade de motoristas e ganhe dinheiro com o seu próprio horário.

source: General policy
pt: Política geral

source: Set your location on map
pt: Defina a sua localização no mapa

# drag_map_to_move_pin
source: Drag the map to move the pin
pt: Arraste o mapa para mover o alfinete

source: Confirm
pt: Confirmar

source: Legal policy
pt: Política legal

source: Home
pt: Início

source: Add a referral
pt: Adicionar referência

# enter_referral_code
source: Enter the referral code
pt: Introduza o código de referência

# enter_referral_code_to_claim_your_reward
source: Enter the referral code to claim your reward
pt: Introduza o código de referência para resgatar a sua recompensa

source: Refer a friend
pt: Recomendar um amigo

# get_euros_directly_in_your_wallet
source: Get €{euro} directly in your Wallet! Refer as many friends as you can to join the Uprides family, and once they each complete their first booking, your reward is yours!
pt: Receba €{euro} diretamente na sua carteira! Recomende tantos amigos quanto quiser para se juntarem à família Uprides e, quando cada um completar a primeira reserva, a recompensa é sua!

source: Refer via
pt: Recomendar via

source: referral link
pt: link de referência

source: Login with Google
pt: Iniciar sessão com o Google

# location_sharing_off
source: Location sharing is currently turned off. Tap here to turn it on.
pt: A partilha de localização está desativada. Toque aqui para ativar.

source: Language
pt: Idioma

source: Applied
pt: Aplicado

# capital_apply
source: APPLY
pt: APLICAR

source: Overview
pt: Visão geral

source: Similar places
pt: Locais semelhantes

source: High rated
pt: Bem avaliados

source: Activity
pt: Atividade

source: is requesting
pt: está a solicitar

# from_you
source: from you. Would you like to view the details?
pt: de si. Quer ver os detalhes?

# promo_heading
source: Get {discountPercentage}% off your next {rideCount} rides. Save up to {currency}{maxSavings} per trip
pt: Obtenha {discountPercentage}% de desconto nas próximas {rideCount} viagens. Poupe até {currency}{maxSavings} por viagem

# promo_subtext
source: We'll apply your best available promo automatically at checkout. Want to use a different one? You can switch promos before payment.
pt: Aplicaremos automaticamente a melhor promoção disponível no checkout. Quer usar outra? Pode trocar de promoção antes do pagamento.

# promo_validity
source: Valid on all ride types.
pt: Válida em todos os tipos de viagem.
