Repository: Ahmadbhatti978/Uprides-customer-app
Catalog: lib/l10n/app_*.arb
Languages: pt

# promo_max_discount
source: Maximum {currency}{maxDiscount} discount per trip.
pt: Desconto máximo de {currency}{maxDiscount} por viagem.

# promo_expiration
source: Expiring on: {expirationDate}
pt: Expira em: {expirationDate}

# promo_cta_button
source: Apply now on booking
pt: Aplicar agora na reserva

# add_payment_method
source: Add your payment method
pt: Adicione o seu método de pagamento

source: Passenger safety
pt: Segurança do passageiro

source: Emergency contact
pt: Contacto de emergência

source: Delete your account?
pt: Eliminar a sua conta?

source: Note:
pt: Nota:

# your_account_will_be_deactivated
source: Your account will be deactivated first and permanently deleted after 30 days
pt: A sua conta será primeiro desativada e eliminada permanentemente após 30 dias

source: Arrived
pt: Chegou

# driver_arrived
source: Your driver has arrived
pt: O seu motorista chegou

# explore_more_on_uprides
source: Explore more with Uprides.
pt: Explore mais com a Uprides.

# locations_too_close
source: The picked locatios are too close
pt: As localizações escolhidas estão demasiado próximas

source: Signup with Google
pt: Criar conta com o Google

source: Complete your information
pt: Complete as suas informações

source: No Internet
pt: Sem internet

# no_internet_des
source: It looks like you're not connected to the internet. Please check your connection and try again.
pt: Parece que não está ligado à internet. Verifique a sua ligação e tente novamente.

source: Retry
pt: Tentar novamente

# password_is_empty
source: Password can't be empty.
pt: A palavra-passe não pode ficar vazia.

# password_must_8_char_long
source: Password must be at least 8 characters long.
pt: A palavra-passe deve ter pelo menos 8 caracteres.

# password_must_contains_one_uppercase
source: Password must contain at least one uppercase letter.
pt: A palavra-passe deve conter pelo menos uma letra maiúscula.

source: Share to
pt: Partilhar com

source: Ride Scheduled
pt: Viagem agendada

# your_ride_has_been_scheduled_for
source: Your ride has been scheduled for {time}
pt: A sua viagem foi agendada para {time}

source: Add a voucher
pt: Adicionar vale

# enter_voucher_number_to_claim
source: Enter the voucher number to claim the amount
pt: Introduza o número do vale para resgatar o montante

source: No vouchers available
pt: Sem vales disponíveis

# you_dont_have_any_available_voucher
source: You don’t have any available voucher at the moment. Organisations can send you vouchers to pay for the trips or other services.
pt: De momento, não tem nenhum vale disponível. As organizações podem enviar-lhe vales para pagar viagens ou outros serviços.

source: Enter voucher code
pt: Introduzir código do vale

source: Pay for {name}
pt: Pagar por {name}

source: Upcoming
pt: Próximas

source: Request Money
pt: Pedir dinheiro

# driver_is_arriving_in
source: Your ride will arrive in
pt: A sua viagem chegará em

source: View request
pt: Ver pedido

source: Cancelling in
pt: A cancelar em

source: Declined
pt: Recusado

source: Message
pt: Mensagem

source: You will arrive in
pt: Chegará em

source: Close
pt: Fechar

# noRidesYetTitle
source: No rides yet
pt: Ainda não tem viagens

# noRidesYetMessage
source: You haven't completed any rides yet. Book your first ride today!
pt: Ainda não concluiu nenhuma viagem. Reserve a sua primeira viagem hoje!

# noCancelledRidesTitle
source: No cancelled rides
pt: Nenhuma viagem cancelada

# noCancelledRidesMessage
source: Looks like you haven't cancelled any rides.
pt: Parece que não cancelou nenhuma viagem.

# noUpcomingRidesTitle
source: No upcoming rides
pt: Nenhuma viagem agendada

# noUpcomingRidesMessage
source: You don't have any rides scheduled. Book one now and we'll see you soon!
pt: Não tem nenhuma viagem agendada. Reserve uma agora e vemo-nos em breve!

# blocked_rideflow_title
source: No drivers in this area yet!
pt: Ainda não há motoristas nesta zona!

# blocked_rideflow_subtitle
source: We’ve just launched and are expanding across all zones and cities. You can enjoy and explore the app, and as soon as rides are available in your area, you’ll receive a notification to start using the service.
pt: Acabámos de lançar e estamos a expandir para todas as zonas e cidades. Pode explorar a aplicação e, assim que houver viagens disponíveis na sua área, receberá uma notificação para começar a usufruir do serviço.
