Repository: Ahmadbhatti978/Uprides-customer-app
Catalog: lib/l10n/app_*.arb
Languages: pt

source: Change
pt: Alterar

# homeQuote
source: Let’s go somewhere new today
pt: Vamos a um sítio novo hoje

source: Suggestions
pt: Sugestões

# previous_ride
source: Previous rides
pt: Viagens anteriores

# trending_locations
source: Explore nearby places
pt: Explorar locais próximos

# what_on_your_mind
source: What's on your mind?
pt: O que tem em mente?

source: Explore more on
pt: Explorar mais em

source: Offer & Discount
pt: Ofertas e descontos

source: Date & Time
pt: Data e hora

source: Login
pt: Iniciar sessão

source: Don't have an account?
pt: Não tem conta?

source: Fare details
pt: Detalhes da tarifa

source: Set location on map
pt: Definir localização no mapa

source: Cancel
pt: Cancelar

source: Enter Password
pt: Introduzir palavra-passe

source: Book ride
pt: Pedir viagem

source: Account
pt: Conta

source: Enter location name
pt: Introduza o nome da localização

source: Next
pt: Seguinte

source: Save card
pt: Guardar cartão

source: Call customer support
pt: Ligar ao apoio ao cliente

source: Send us an email
pt: Envie-nos um email

source: Enter Coupon Code
pt: Introduzir código promocional

source: Enter @user/paymentID
pt: Introduzir @user/paymentID

source: Request payment
pt: Pedir pagamento

source: Contact chat support
pt: Contactar suporte por chat

source: Submit
pt: Submeter

source: Call driver
pt: Ligar ao motorista

source: Accept & veiw
pt: Aceitar e ver

source: Getting Location...
pt: A obter localização...

source: Error getting location
pt: Erro ao obter a localização

source: Google Pay payment succesfully completed
pt: Pagamento com Google Pay concluído com sucesso

source: Google pay is not supported on this device
pt: O Google Pay não é suportado neste dispositivo

source: Error
pt: Erro

source: Okay
pt: Ok

source: Receipt
pt: Recibo

source: Payment
pt: Pagamento

source: Success
pt: Sucesso

source: Scan me
pt: Faça scan

source: August 21, 2024
pt: 21 de agosto de 2024

source: (Excellent)
pt: (Excelente)

source: View details
pt: Ver detalhes

source: Total rating
pt: Classificação total

source: Good
pt: Bom

source: Average
pt: Médio

source: Bad
pt: Mau

source: Worst
pt: Péssimo

source: Risk free cancellation
pt: Cancelamento sem risco

source: You’re on a trip
pt: Está numa viagem

source: Please select any cancellation plan as per your preferred choice.
pt: Selecione um plano de cancelamento de acordo com a sua preferência.

source: Cancellation protection
pt: Proteção de cancelamento

source: You’ll receive 80% of the total refund in case of any medical emergency.
pt: Receberá 80% do reembolso total em caso de emergência médica.

source: Premium protection
pt: Proteção premium

source: I will take risk and does not wish for refund
pt: Assumo o risco e não pretendo reembolso

source: Offers & Promotions
pt: Ofertas e promoções

source: Check for discount
pt: Verificar desconto

source: Your driver
pt: O seu motorista

source: Vehicle details
pt: Detalhes do veículo

source: Travellers details
pt: Detalhes dos passageiros

source: Travellers will receive the booking information by adding the contact information.
pt: Os passageiros receberão a informação da reserva ao adicionar os dados de contacto.

source: +Add new traveller
pt: + Adicionar novo passageiro

source: Intercity
pt: Intercidades

source: Filter
pt: Filtro

source: Start your intercity journey with the ease & comfort
pt: Comece a sua viagem entre cidades com facilidade e conforto

source: Select your trip
pt: Selecione a sua viagem

source: Total passengers
pt: Total de passageiros

source: Find trip
pt: Procurar viagem

source: Welcome to
pt: Bem-vindo à

source: Privacy
pt: Privacidade

source: Report issue
pt: Reportar problema

source: Saved location
pt: Localização guardada

source: Help
pt: Ajuda

source: Please Allow Location to continue your service
pt: Ative a localização para continuar a utilizar o serviço

source: Where do you want to go?
pt: Para onde quer ir?

# budget_friendlyn_rides
source: Budget friendly rides
pt: Viagens económicas

source: Learn more
pt: Saber mais

source: Lisbon
pt: Lisboa

source: Sort by
pt: Ordenar por

source: Download invoice
pt: Transferir fatura

source: Economy
pt: Económica

source: Invoice
pt: Fatura

source: Benz C-Class
pt: Benz Classe C

source: Start time
pt: Hora de início

source: End time
pt: Hora de fim

source: Fair
pt: Tarifa

source: Base fair
pt: Tarifa base

source: Completed
pt: Concluída

source: Promotion
pt: Promoção

source: Amount paid
pt: Valor pago

source: Review request
pt: Analisar pedido

source: Edit
pt: Editar

source: Cancelled
pt: Cancelada

source: Reservation time
pt: Hora da reserva

source: Service type
pt: Tipo de serviço

source: Total charge
pt: Encargo total

source: Rentals
pt: Alugueres

source: View breakdown
pt: Ver discriminação

source: Hello, let’s start your rental journey
pt: Olá, vamos começar a sua experiência de aluguer

source: Select date
pt: Selecionar data

source: End date
pt: Data de fim

source: Pick-up & Deliver on the selective locations
pt: Recolha e entrega em locais selecionados

source: Search CAR
pt: Procurar carro

source: rental
pt: aluguer

source: Total charges
pt: Total a pagar

source: Due now
pt: A pagar agora

source: Zain Calzoni + 1 Traveller
pt: Zain Calzoni + 1 passageiro

source: Features
pt: Funcionalidades

source: More mileage
pt: Mais quilometragem

source: Spacious
pt: Espaçoso

source: Pickup & Drop
pt: Recolha e entrega

source: Pickup
pt: Recolha

source: Drop
pt: Entrega

# otp_verification
source: Code Verification
pt: Verificação de código

source: Resend OTP
pt: Reenviar código

source: Resending OTP in:
pt: A reenviar código em:

source: seconds
pt: segundos

source: Forgot Your Password?
pt: Esqueceu-se da palavra-passe?

source: Enter your registered phone number & verify
pt: Introduza o número de telefone registado e verifique

source: Login to continue
pt: Inicie sessão para continuar

source: Done
pt: Concluído

source: Sign up
pt: Criar conta

source: Suggested username
pt: Nome de utilizador sugerido

# hello_register_to_get_started
source: Let’s get you started!
pt: Vamos começar!

source: or signup with
pt: ou crie conta com

source: Logout
pt: Terminar sessão

source: First Name
pt: Nome

source: Already have an account?
pt: Já tem conta?

source: Login here
pt: Inicie sessão aqui

source: Hello! Welcome back
pt: Olá! Bem-vindo de volta

# sign_in_to_continue
source: Login to continue
pt: Inicie sessão para continuar

source: Signup here
pt: Crie conta aqui

source: Reset Password
pt: Redefinir palavra-passe

source: Sign up to continue
pt: Crie conta para continuar

source: Select a ride
pt: Escolha uma viagem

source: Pet friendly
pt: Aceita animais

source: Assist
pt: Assistência

source: promotion applied
pt: promoção aplicada

source: Book now to reserve your seat
pt: Reserve agora para garantir o seu lugar

source: Your rated $rate stars to this ride
pt: Atribuiu rate estrelas a esta viagem

source: Add tip to
pt: Adicionar gorjeta a

source: Confirm & Pay
pt: Confirmar e pagar

source: Confirm your price
pt: Confirme o seu preço

source: Processing
pt: A processar

source: Payment Request
pt: Pedido de pagamento

source: Dear user,
pt: Caro utilizador,

source: have requested you for
pt: solicitou-lhe

source: Apply
pt: Aplicar

source: T&C Apply
pt: Aplicam-se T&C

source: Request from
pt: Pedido de

source: Finding Best Route
pt: A encontrar a melhor rota

source: Confirm locations
pt: Confirmar localizações

source: Back
pt: Voltar

source: Oops!
pt: Ups!

source: Ride Cancelled
pt: Viagem cancelada

source: Your ride has been cancelled
pt: A sua viagem foi cancelada

source: Redirecting in
pt: A redirecionar em

source: Searching nearby rides...
pt: A procurar viagens perto de si...

source: Arriving in
pt: A chegar em

# cancel_your_ride
source: Do you want to cancel your ride?
pt: Quer cancelar a sua viagem?

source: Your driver is on his way to pick you up.
pt: O seu motorista está a caminho para o ir buscar.

source: Go back
pt: Voltar

source: Cancel ride
pt: Cancelar viagem

source: Contact your driver
pt: Contactar o motorista

source: Recommended
pt: Recomendado

source: Safety tips?
pt: Dicas de segurança?

source: Ask anything...
pt: Pergunte o que quiser...

source: Select a reason to cancel
pt: Selecione um motivo para cancelar

# no_ride_available_at_the_moment
source: No ride available right now.
pt: Não há viagens disponíveis de momento.

# increase_ride_fare
source: Boost your fare
pt: Aumente a sua tarifa

# bidding_des
source: Note: Boosting your fare can help get a ride faster.You’ll only pay the difference on top of your original fare.
pt: Nota: Aumentar a sua tarifa pode ajudar a conseguir uma viagem mais rápido. Pagará apenas a diferença além da tarifa original.

source: Recent travel
pt: Viagem recente

source: Date
pt: Data

source: Time
pt: Hora

source: Reschedule
pt: Reagendar

source: You can change the Date&Time of your ride or book it now
pt: Pode alterar a data e hora da sua viagem ou reservá-la agora

source: Change Date&Time
pt: Alterar data e hora

source: Book for Now
pt: Reservar para agora

source: Destructive Action
pt: Ação irreversível

source: Add Stop
pt: Adicionar paragem

source: Notification
pt: Notificações

source: Booking details
pt: Detalhes da reserva

source: Need help ?
pt: Precisa de ajuda?

source: Date & Time
pt: Data e hora

source: Recent Trip
pt: Viagem recente

source: Get Help
pt: Obter ajuda

source: Rebook
pt: Reservar novamente

source: What's
pt: O que está

source: trending
pt: em alta

source: around you
pt: à sua volta

source: I dropped you to peter mall
pt: Deixei-o no Peter Mall

source: Newest
pt: Mais recente

source: Archived
pt: Arquivadas

source: Microphone Permission Required
pt: Permissão do microfone necessária

source: This app needs microphone access to make voice calls. Please enable microphone permissions in your device settings.
pt: Esta app precisa de acesso ao microfone para fazer chamadas de voz. Ative as permissões do microfone nas definições do dispositivo.

source: Open Settings
pt: Abrir definições

source: Call Error
pt: Erro de chamada

source: Voice Call
pt: Chamada de voz

source: In case or urgency you can now reach out to our support team for help. Or, your driver is here to proceed with this conversation.
pt: Em caso de urgência pode contactar a nossa equipa de suporte para obter ajuda. Ou o seu motorista está aqui para prosseguir esta conversa.

source: Please note that your conversation is accessible to the BOLD app team.
pt: Tenha em atenção que a sua conversa é acessível à equipa da app BOLD.

# trending_location
source: Explore nearby places
pt: Explorar locais próximos

source: Places to visit
pt: Locais a visitar

source: mins away
pt: min de distância

source: View more
pt: Ver mais

source: you can take this username
pt: pode usar este nome de utilizador

source: Places to visit nearby
pt: Locais a visitar por perto

source: Best time to visit 09:30 am
pt: Melhor hora para visitar 09:30

source: Opens at
pt: Abre às

source: Show99
pt: Mostrar99

source: Create Password
pt: Criar palavra-passe

source: About
pt: Sobre

# send_otp
source: Send code
pt: Enviar código

source: Login with Email
pt: Iniciar sessão com email

source: Enter email address
pt: Introduza o email

source: Whats happening nearby
pt: O que está a acontecer por perto

source: Explore more
pt: Explorar mais

source: Confirm your address
pt: Confirme o seu endereço

source: Add address
pt: Adicionar endereço

source: Address
pt: Endereço

source: Name
pt: Nome

source: Last Name
pt: Apelido

source: Take a screenshot
pt: Tirar captura de ecrã

source: Take a screen recording
pt: Gravar o ecrã

source: Select from gallery
pt: Selecionar da galeria

source: Switch rider
pt: Mudar de passageiro

source: Add a rider
pt: Adicionar passageiro

source: Add rider details
pt: Adicionar detalhes do passageiro

source: Rider full name
pt: Nome completo do passageiro

source: Rider phone number
pt: Número de telefone do passageiro

source: We won’t share this phone number with the driver
pt: Não partilharemos este número de telefone com o motorista

# agree_to_share_trip_details
source: By adding the rider you agree that we have this person’s information to send them the trip details in the Uprides app through text or email.
pt: Ao adicionar o passageiro, concorda que temos a informação desta pessoa para lhe enviar os detalhes da viagem na app Uprides por SMS ou email.

source: Your name
pt: O seu nome

source: Your email address
pt: O seu email

source: Your phone number
pt: O seu número de telefone

source: Delete account
pt: Eliminar conta

source: Last update on July 22, 2024
pt: Última atualização em 22 de julho de 2024

source: Got it
pt: Percebi

source: View your earned rewards
pt: Veja as suas recompensas

# reedem_our_reward_points_to_enjoy_great_discounts_and_offers
source: Reedem your reward points to enjoy great discounts and offers.
pt: Troque os seus pontos para usufruir de ótimos descontos e ofertas.

# add_money_to_bold_wallet
source: Add money to wallet
pt: Adicionar dinheiro à carteira

source: Promos
pt: Promoções

source: hrs
pt: h

source: hr
pt: h

source: Complete your payment faster with wallet.
pt: Pague mais rápido com a carteira.

source: Safety
pt: Segurança

# rentals_subtitle
source: Self drive car of your choice
pt: Carro de condução própria à sua escolha

# packages_subtitle
source: Send your package faster with BOLD
pt: Envie a sua encomenda mais rápido com a BOLD

# jump_start_subtitle
source: Want a quick spark to re-start?
pt: Precisa de um impulso rápido para voltar a arrancar?

# intercity_subtitle
source: Travel intercity with ease
pt: Viaje entre cidades com facilidade

# sos_subtitle
source: Have someone blocked your vehicle?
pt: Alguém bloqueou o seu veículo?

source: Offers
pt: Ofertas

source: Referral
pt: Recomendações

source: Vouchers
pt: Vales

source: Support
pt: Suporte

source: Account services
pt: Serviços da conta

source: • Valid on all rides
pt: • Válida em todas as viagens

source: Expiring on: 12 August, 2024
pt: Expira em: 12 de agosto de 2024

source: Apply now on booking
pt: Aplicar agora na reserva

source: Hello, how can we help you?
pt: Olá, como podemos ajudar?

source: Trusted contacts
pt: Contactos de confiança

source: Share your live location
pt: Partilhar localização em tempo real

source: Add your trusted contact
pt: Adicionar contacto de confiança

source: Set as primary
pt: Definir como principal

source: Remove
pt: Remover

# book_a_cab_and_let_your_known_one_pay_for_you
source: Request a ride payment from a friend or family member.
pt: Peça uma viagem e peça a um amigo ou familiar para pagar por si.

source: Enter the Payment ID
pt: Introduza o ID de pagamento

source: Enter the payment ID of the person with whom you want to request the money.
pt: Introduza o ID de pagamento da pessoa a quem quer pedir o dinheiro.

# add_a_note
source: Add a message
pt: Adicionar mensagem

source: Your request will expire in
pt: O seu pedido expira em

source: minutes
pt: minutos

source: . By sharing the link, you accept our
pt: . Ao partilhar a ligação, aceita os nossos

source: Terms and conditions
pt: Termos e condições

source: Total wallet balance
pt: Saldo total da carteira

source: + Add funds
pt: + Adicionar fundos

source: Payment methods
pt: Métodos de pagamento

source: Invite friends
pt: Convidar amigos

# invite_friends_des
source: Invite your friends to use Uprides app.
pt: Convide os seus amigos a usar a app Uprides.

source: Add payment methods
pt: Adicionar métodos de pagamento

source: Available vouchers
pt: Vales disponíveis

source: Expires on: 12/02/2023
pt: Expira em: 12/02/2023

source: Added to wallet
pt: Adicionado à carteira

source: Redeem and add to wallet
pt: Resgatar e adicionar à carteira

source: Payment request sent
pt: Pedido de pagamento enviado

source: Add emergency contact
pt: Adicionar contacto de emergência

source: Person full name
pt: Nome completo

source: Person phone number
pt: Número de telefone

source: Add your card details
pt: Adicionar dados do cartão

source: Scan Card
pt: Digitalizar cartão

source: Good morning,
pt: Bom dia,

source: Today, 12 August, 2024
pt: Hoje, 12 de agosto de 2024

source: Expires on: 12/02/2025
pt: Expira em: 12/02/2025

source: Redeem now
pt: Resgatar agora

source: Your reward is expiring soon.
pt: A sua recompensa está a expirar em breve.

source: to enjoy the cash points
pt: para usufruir dos pontos.

source: Select an option
pt: Selecione uma opção

source: Stuck in the parking
pt: Preso no estacionamento

source: (Report nearby vehicle)
pt: (Reportar veículo próximo)

source: Got scratch in your vehicle
pt: Tem um risco no seu veículo

source: Vehicle damaged by someone nearby
pt: Veículo danificado por alguém nas proximidades

source: Report other issue
pt: Reportar outro problema

source: Send parking SoS
pt: Enviar SOS de estacionamento

source: Enter the blocking vehicle number
pt: Introduza a matrícula do veículo que está a bloquear

source: Stuck anywhere? Let’s begin then
pt: Preso em algum local? Vamos começar então

source: Register your car
pt: Registe o seu carro

source: Parking
pt: Estacionamento

source: 👋 Hi Robert,
pt: 👋 Olá, Robert,

source: Confirm new password
pt: Confirmar nova palavra-passe

source: Book for Jump-Start
pt: Pedir Jump-Start

source: Your location
pt: A sua localização

source: Please enter you location to jump start under ‘Your location’ and continue to call for your emergency jump-start service.
pt: Introduza a sua localização em ‘A sua localização’ e continue para chamar o serviço de emergência de arranque.

source: Most reliable and fast service
pt: O serviço mais fiável e rápido

source: Enter your vehicle number
pt: Introduza a matrícula do veículo

source: Enter your vehicle name
pt: Introduza o nome do seu veículo

source: Add receivers details
pt: Adicionar detalhes do destinatário

source: Receiver
pt: Destinatário

source: Receiver full name
pt: Nome completo do destinatário

source: Receiver phone number
pt: Número de telefone do destinatário

source: Now its more easy to send your package.
pt: Agora é ainda mais fácil enviar a sua encomenda.

source: Send
pt: Enviar

source: Receive
pt: Receber

source: Packages
pt: Encomendas

source: How many package are you sending?
pt: Quantas encomendas está a enviar?

source: $items Packages
pt: $items encomendas

source: By clicking this you agree our
pt: Ao clicar aqui, concorda com os nossos

source: Package type
pt: Tipo de encomenda

source: Document
pt: Documento

source: Other
pt: Outro

source: Trip details
pt: Detalhes da viagem

source: Signup with Apple
pt: Criar conta com a Apple

source: Uploaded Image
pt: Imagem carregada

source: Package
pt: Encomenda

source: + Add package
pt: + Adicionar encomenda

# trouble_signing_in
source: Trouble logging in?
pt: Problemas a iniciar sessão?

source: inch
pt: pol

source: Delete
pt: Eliminar

source: Add package photos
pt: Adicionar fotos da encomenda

source: Services
pt: Serviços

source: Job
pt: Emprego

source: Phone no.
pt: Nº de telefone

# ontinue
source: Continue
pt: Continuar

source: Login with Phone
pt: Iniciar sessão com o telefone

source: Login with Apple
pt: Iniciar sessão com a Apple

source: Signup with Email
pt: Criar conta com email

source: Enter new password
pt: Introduzir nova palavra-passe

source: Code verified
pt: Código verificado

source: Schedule
pt: Agendar

source: For someone
pt: Para outra pessoa

source: For later
pt: Para mais tarde

# cab_type
source: Ride type
pt: Tipo de viagem

source: Base fare
pt: Tarifa base

source: Search for language
pt: Procurar idioma

source: Search Again
pt: Procurar novamente

source: Search Ride
pt: Procurar viagem

source: Cancel request
pt: Cancelar pedido

source: Wallet
pt: Carteira

source: Your profile
pt: O seu perfil

source: Save
pt: Guardar

source: VAT
pt: IVA

source: VAT Amount
pt: Valor de IVA

source: Rate your trip
pt: Avalie a sua viagem

source: Select one or more issues
pt: Selecione um ou mais problemas

source: Select one or more compliments
pt: Selecione um ou mais elogios

source: select up to 5 issues
pt: selecione até 5 problemas

source: More issues >
pt: Mais problemas >

source: More compliments >
pt: Mais elogios >

# addTipTo
source: Add tip to {driverName}
pt: Adicionar gorjeta a {driverName}

# yourTripWas
source: Your trip was €{amount}
pt: A sua viagem foi €{amount}

source: Talking on phone
pt: A falar ao telemóvel

source: Unsafe ride
pt: Viagem insegura

source: Smoking
pt: A fumar

source: Riding very fast
pt: Condução muito rápida

source: Missed turn
pt: Saída perdida

source: Unhygienic
pt: Pouco higiénico

source: Bad attitude
pt: Mau comportamento

source: Poor communication
pt: Má comunicação

source: No AC
pt: Sem ar condicionado

source: Phone usage
pt: Uso do telemóvel

source: Unsafe lane
pt: Condução em faixa insegura

source: No seatbelt
pt: Sem cinto de segurança

source: Very professional
pt: Muito profissional

source: Clean car
pt: Carro limpo

source: Safe driving
pt: Condução segura

source: Great service
pt: Ótimo serviço

source: Highly punctual
pt: Muito pontual

source: Polite behavior
pt: Comportamento cortês

source: Well-mannered
pt: Bem-educado

# cancelRideDialog_cancellationCharges
source: Cancellation charges : € {amount}
pt: Taxas de cancelamento: € {amount}

# cancelRideDialog_question
source: Are you sure you want to cancel?
pt: Tem a certeza de que quer cancelar?

# cancelRideDialog_noChargeInfo
source: There will be no cancellation fee applied.
pt: Não será aplicada qualquer taxa de cancelamento.

# cancelRideDialog_chargeInfo
source: There will be a cancellation charge of € {fee}.
pt: Será aplicada uma taxa de cancelamento de € {fee}.

# cancelRideDialog_refundInfo
source: Your refunded amount will be € {refund}.
pt: O seu valor de reembolso será € {refund}.

# no_drivers_found_title
source: No Drivers Found Nearby
pt: Não foram encontrados motoristas nas proximidades

# no_drivers_found_content
source: We couldn't find any available drivers near your location at the moment.
pt: Não encontrámos motoristas disponíveis perto de si neste momento.

source: Trip Confirmed
pt: Viagem confirmada

# driver_details_share_info
source: We’ll share your driver details by {dateTime}
pt: Partilharemos os detalhes do seu motorista até {dateTime}

source: Resending code in:
pt: A reenviar código em:

# code_sent_to_contact
source: Code has been sent to the {contact}.
pt: O código foi enviado para {contact}.

source: Choose a @username
pt: Escolha um @nome_de_utilizador

# paymentRequestSentInfo
source: We’ve sent your payment request to: {fullName}. Please don’t close the app or go back while we process your request.
pt: Enviámos o seu pedido de pagamento para: {fullName}. Não feche a app nem volte atrás enquanto processamos o seu pedido.

# ensuringVehicleSafetyTitle
source: Ensuring Vehicle Safety: A Priority in Our Ride Application
pt: Garantir a segurança do veículo: uma prioridade na nossa aplicação de mobilidade

# ensuringVehicleSafetyDesc
source: When it comes to transportation, safety is paramount. Our ride application is designed not only to provide a convenient and efficient travel experience but also to ensure that every journey is as safe as possible. Here's how we prioritize vehicle safety for our passengers and drivers:
pt: Quando se trata de transporte, a segurança é fundamental. A nossa aplicação foi concebida não só para proporcionar uma experiência conveniente e eficiente, mas também para garantir que cada viagem é o mais segura possível. Eis como priorizamos a segurança dos veículos para passageiros e motoristas:
